# Custom bicycle road detection model
nc: 21

# Custom bicycle road detection model
#backbone:
#  - [-1, 1, GhostConv, [64, 3, 2]]  # 0-P1/2
#  - [-1, 1, GhostConv, [128, 3, 2]]  # 1-P2/4
#  - [-1, 3, C3Ghost, [128]]
#  - [-1, 1, GhostConv, [256, 3, 2]]  # 3-P3/8
#  - [-1, 6, C3Ghost, [256]]
#  - [-1, 1, C2PSA, [256]]  # Spatial attention for stability
#  - [-1, 1, GhostConv, [512, 3, 2]]  # 6-P4/16
#  - [-1, 6, C3Ghost, [512]]
#  - [-1, 1, GhostConv, [1024, 3, 2]]  # 8-P5/32
#  - [-1, 3, C3Ghost, [1024]]
#  - [-1, 1, SPPF, [1024, 5]]  # 10
# 백본 채널 축소 버전
backbone:
  - [-1, 1, GhostConv, [48, 3, 2]]   # 0-P1/2 (64 → 48)
  - [-1, 1, GhostConv, [96, 3, 2]]   # 1-P2/4 (128 → 96)
  - [-1, 2, C3Ghost, [96]]           # 3 → 2회 반복
  - [-1, 1, GhostConv, [192, 3, 2]]  # 3-P3/8 (256 → 192)
  - [-1, 4, C3Ghost, [192]]          # 6 → 4회 반복
  - [-1, 1, C2PSA, [192]]            # 채널 축소
  - [-1, 1, GhostConv, [384, 3, 2]]  # 6-P4/16 (512 → 384)
  - [-1, 4, C3Ghost, [384]]          # 6 → 4회 반복
  - [-1, 1, GhostConv, [768, 3, 2]]  # 8-P5/32 (1024 → 768)
  - [-1, 2, C3Ghost, [768]]          # 3 → 2회 반복
  - [-1, 1, SPPF, [768, 5]]          # 채널 축소  - [-1, 1, C2PSA, [1024]]  # Additional spatial attention
 

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 13
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 16 (P3/8-small)
  
  - [-1, 1, GhostConv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 19 (P4/16-medium)
  
  - [-1, 1, GhostConv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 22 (P5/32-large)
  
  - [[16, 19, 22], 1, Detect, [nc]]  # Detect(P3, P4, P5)
